// Программа выводит таблицу значений функции y = x^2 + 3x - 7 с шагом 0.5 в диапазоне от -2 до 2
// ------------------
//     x   |    y
// ------------------
//     x1  |    y1
//     x2  |    y2
// ------------------

#include <stdio.h>

#define LB -2.0 // нижняя граница диапазона изменения аргумента
#define HB 2.0 // верхняя граница диапазона изменения аргумента
#define DX 0.5 // приращение аргумента

int main()
{
	double x, y;
	
	int n = (HB - LB) / DX + 1; // количество точек
	
	printf("------------------\n");
	printf("    x   |    y\n");
	printf("------------------\n");
	
	x = LB;
	for (int i = 0; i < n; ++i) {
		y = x * x + 3 * x - 7;
		printf("%6.2f  | %6.2f\n", x, y);
		x += DX;
	}
	
	printf("------------------\n");
}